rails/app/controllers/api/v1/current/articles_controller.rb

  def show
    article = current_user.articles.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 3 AND `articles`.`id` = NULL LIMIT 1

  def create
    unsaved_article = current_user.articles.unsaved.first || current_user.articles.create!(status: :unsaved)
---
INSERT INTO `articles` (`title`, `content`, `status`, `user_id`, `created_at`, `updated_at`) VALUES (NULL, NULL, 10, 3, '2023-12-26 11:46:12.975976', '2023-12-26 11:46:12.975976')
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 3 AND `articles`.`status` = 10 ORDER BY `articles`.`id` ASC LIMIT 1

  def update
    article = current_user.articles.find(params[:id])
    article.update!(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 3 AND `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'テストタイトル2', `articles`.`content` = 'テスト本文2', `articles`.`status` = 30, `articles`.`updated_at` = '2023-12-23 18:33:46.637165' WHERE `articles`.`id` = 3